A = csvread('graph.csv')
N = length(A)
I = eye(N)
A_I = A + I
D_I = sum(A_I).^(-1/2)
D_I = diag(D_I)
L = D_I * A_I * D_I

%初始化为一个随机的权重
[W_1,W_2,W_3] = initW(N)
alpha = 0.01


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%疯狂循环以下代码%%%%%%%%%%%%%%%%%%%%
[z_1,E_1,z_2,E_2,E_3,loss] = front(L,I,W_1,W_2,W_3,1,1);  %In阵营
[dW1,dW2,dW3]=backGrad(E_3,L,E_1,E_2,W_2,W_3,1,1);
W_1 = W_1 - alpha * dW1;
W_2 = W_2 - alpha * dW2;
W_3 = W_3 - alpha * dW3;
[z_1,E_1,z_2,E_2,E_3,loss] = front(L,I,W_1,W_2,W_3,34,0);  %Ad阵营
[dW1,dW2,dW3]=backGrad(E_3,L,E_1,E_2,W_2,W_3,34,0);
W_1 = W_1 - alpha * dW1;
W_2 = W_2 - alpha * dW2;
W_3 = W_3 - alpha * dW3;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%结果输出

%第n个节点的输出 output_n = sigmoid(E_2(n,:), W_3);
















